from AIBOT import BOT


def main():
	my_bot = BOT()
	# sentence = "قد من بلندتر است یا تو؟"
	# sentence = "فردا هوای تهران ابری است؟"
	# sentence = "اذان ظهر تهران ساعت چند است؟"
	# sentence = "ساعت تهران چند است؟"
	# sentence = "روز جمهوری اسلامی در سال ۱۴۰۰ چه روزی است؟"
	# sentence = "دمای هوای امروز تهران چند درجه است؟"
	# sentence = "قد من بلندتر است یا تو؟"
	# sentence = " سردترین اذان ظهر تهران در ۲روز آینده کدام روز است؟"
	# sentence = "دمای هوای فردای پایتخت ایران چند درجه است؟"
	# sentence = "اذان ظهر تهران درروز عاشورا سال ۱۴۰۰چه ساعتی است ؟"
	# sentence = "میانگین دمای تهران در ۲روز آینده ساعت ۳ بعد از ظهر چقدر است؟"
	# sentence = "اذان ظهر به افق ساری چه وقت است؟"
	sentence = "آب و هوای فردای تهران ساعت 18:35 چه طور است؟"
	answer = my_bot.AIBOT(sentence)
	print(answer)


if __name__ == "__main__":
	main()
